Akash-shakya/ssd1306_with_STM32F401/main.c

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "font.h"
#include "oled.h"
#include "stm32f4xx_hal.h"
#include <stdbool.h>
/* Private includes ----------------------------------------------------------*/
// Pin definitions for push buttons
#define BUTTON_LEFT GPIO_PIN_0
#define BUTTON_RIGHT GPIO_PIN_1
#define BUTTON_PORT GPIOA

// Motor control pins (DRV8833 Motor Driver)
#define MOTOR_IN1_PIN GPIO_PIN_4
#define MOTOR_IN2_PIN GPIO_PIN_5
#define MOTOR_IN3_PIN GPIO_PIN_6
#define MOTOR_IN4_PIN GPIO_PIN_7
#define MOTOR_PORT GPIOA

I2C_HandleTypeDef hi2c1;

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
void updateDisplay(void);
void erasePreviousLine(void);

// Line position variables
int lineX1 = 64;
int lineY1 = 30;
int lineX2 = 64;
int lineY2 = 60;

int main(void)
{

  HAL_Init();
  SystemClock_Config();
  MX_GPIO_Init();
  MX_I2C1_Init();

  SSD1306_Init();   //INITIALIZE SSD1306 OLED DSPLAY

  // Initial display setup
  SSD1306_Clear();
  SSD1306_GotoXY(5, 2);
  SSD1306_Puts("AIIMS NETS", &Font_11x18, 1);
  drawRectangle(17, 30, 113, 60, true);
  drawLine(lineX1, lineY1, lineX2, lineY2, 1);
  drawLine(64, 27, 64, 63, 1);
  SSD1306_UpdateScreen();

  while(1)
  {
	  if (HAL_GPIO_ReadPin(BUTTON_PORT, BUTTON_LEFT) == GPIO_PIN_SET)
	  {
	       HAL_GPIO_WritePin(MOTOR_PORT, MOTOR_IN1_PIN, GPIO_PIN_SET);
	       HAL_GPIO_WritePin(MOTOR_PORT, MOTOR_IN2_PIN, GPIO_PIN_RESET);
	       HAL_GPIO_WritePin(MOTOR_PORT, MOTOR_IN3_PIN, GPIO_PIN_RESET);
	       HAL_GPIO_WritePin(MOTOR_PORT, MOTOR_IN4_PIN, GPIO_PIN_SET);
	       // Move the line to the left
	       if (lineX1 > 20) {
	    	 erasePreviousLine();
	         lineX1--;
	         lineX2--;
	         updateDisplay();
	       }
	   }

	  else if (HAL_GPIO_ReadPin(BUTTON_PORT, BUTTON_RIGHT) == GPIO_PIN_SET)
	  {
	        HAL_GPIO_WritePin(MOTOR_PORT, MOTOR_IN1_PIN, GPIO_PIN_RESET);
	        HAL_GPIO_WritePin(MOTOR_PORT, MOTOR_IN2_PIN, GPIO_PIN_SET);
	        HAL_GPIO_WritePin(MOTOR_PORT, MOTOR_IN3_PIN, GPIO_PIN_SET);
	        HAL_GPIO_WritePin(MOTOR_PORT, MOTOR_IN4_PIN, GPIO_PIN_RESET);
	        // Move the line to the right
	        if (lineX2 < 110) {
	          erasePreviousLine();
	          lineX1++;
	          lineX2++;
	          updateDisplay();
	        }
	   }
	else
	{
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_6, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_RESET);		//motor off
	}

	HAL_Delay(1); // Add a small delay to debounce the buttons

  }
}

void erasePreviousLine(void) {
  // Erase the previous line by redrawing it in black (color 0)
  int lineThickness = 3;
  for (int i = -lineThickness / 2; i <= lineThickness / 2; i++) {
    drawLine(lineX1 + i, lineY1+1, lineX2 + i, lineY2-1, 0);
  }
  SSD1306_UpdateScreen();
}

void updateDisplay(void) {
  // Draw the updated thicker line in the middle of the rectangle
  int lineThickness = 3;  // Set the thickness of the line
  for (int i = -lineThickness / 2; i <= lineThickness / 2; i++) {
	  drawLine(lineX1 + i, lineY1, lineX2 + i, lineY2, 1);
  }
  SSD1306_UpdateScreen();
}


void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 16;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV4;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief I2C1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2C1_Init(void)
{
  hi2c1.Instance = I2C1;
  hi2c1.Init.ClockSpeed = 400000;
  hi2c1.Init.DutyCycle = I2C_DUTYCYCLE_2;
  hi2c1.Init.OwnAddress1 = 0;
  hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
  hi2c1.Init.OwnAddress2 = 0;
  hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
  hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
  if (HAL_I2C_Init(&hi2c1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN I2C1_Init 2 */

  /* USER CODE END I2C1_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
/* USER CODE BEGIN MX_GPIO_Init_1 */
/* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7, GPIO_PIN_RESET);

  /*Configure GPIO pins : PA0 PA1 */
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : PA4 PA5 PA6 PA7 */
  GPIO_InitStruct.Pin = GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
